In [2]:
import numpy as np
import pandas as pd

In [7]:
data = {
    "name": ["Rohit", "Aman", "Priya", "Neha", "Karan"],
    "age": [22, 23, 21, 24, 22],
    "city": ["Delhi", "Mumbai", "Pune", "Chennai", "Kolkata"],
    "marks": [85, 78, 92, 88, 76],
    "placed": [True, False, True, True, False]
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    name  age     city  marks  placed
0  Rohit   22    Delhi     85    True
1   Aman   23   Mumbai     78   False
2  Priya   21     Pune     92    True
3   Neha   24  Chennai     88    True
4  Karan   22  Kolkata     76   False

In [11]:
data_list = [
    ["Rohit", 22, "Delhi", 85],
    ["Aman", 23, "Mumbai", 78],
    ["Priya", 21, "Pune", 92],
    ["Neha", 24, "Chennai", 88],
    ["Karan", 22, "Kolkata", 76]
]

In [17]:
columns_name = ["Name", "Age", "City", "Marks"]
df2 = pd.DataFrame(data_list, columns=columns_name)

In [18]:
df2

    Name  Age     City  Marks
0  Rohit   22    Delhi     85
1   Aman   23   Mumbai     78
2  Priya   21     Pune     92
3   Neha   24  Chennai     88
4  Karan   22  Kolkata     76